/*
Какое будет выведено значение: let x = 5; alert( x++ ); ? => 5
Какое будет выведено значение: let x = 5; alert( ++x ); ? => 6
 
Чему равно такое выражение: [ ] + false - null + true ? => NaN

Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? => 2

Чему равна сумма [ ] + 1 + 2? => "12" - [] выводит пустую строку дальше конкат

Что выведет этот код: alert( "1"[0] ) ? =>  "1"

Чему равно 2 && 1 && null && 0 && undefined ? => null - первый false

Есть ли разница между выражениями? !!( a && b ) и (a && b)? => false  

Что выведет этот код: alert( null || 2 && 3 || 4 ); ? => 3 - первый true && - 1; || - 2

a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? => false

Что выведет этот код: alert( +"Infinity" ); ? => Infinity

Верно ли сравнение: "Ёжик" > "яблоко"? =>  false (unicode)

Чему равно 0 || "" || 2 || undefined || true || falsе ? => 2
*/
